---
kind: method
id: M:Autodesk.Revit.DB.Macros.ModuleSettings.Dispose
source: html/058a8179-37b1-3b05-8f39-a61de83b0feb.htm
---
# Autodesk.Revit.DB.Macros.ModuleSettings.Dispose Method

Releases all resources used by the ModuleSettings

## Syntax (C#)
```csharp
public void Dispose()
```